/**
 *  Написать функцию, которая возвращает результат при успешном запросе.
 *  В случае неуспеха повторять запрос максимум 5 раз.
 *  После 5-го раза выбрасывает ошибку с текстом "Не удалось получить данные"
 * 
 *  Ограничения: Нельзя использовать async|await
 */

/**
 *  Написать функцию, которая рендерит сообщения в порядке возрастания message.id. 
 *  Айди сообщения начинаются с 1.
 *  Сообщения могут приходит в неправильном порядке.
 * 
 *  Задача: вывести сообщения как можно скорее в верном порядке.
 */

/**
 *  Написать функцию, которая возвращает результат для пути состоящий из ключей разделенных точкой
 *  Иначе вернуть undefined если значения по указанному пути нет
 * 
 *  Ограничения: нельзя использовать рекурсию
 *  Пример: get(example, 'a.b.c.d.e') === 1
 */

/**
 *  Написать функцию, которая возвращает true если строка является полиндромом
 *  Иначе вернуть false.
 * 
 *  Условия: 
 *    1) слова могут быть на русском и английском языках
 *    2) не учитывать знаки препинания, пробелы и регистр букв
 * 
 *  Пример: "a", "bb" "боб", "дед", "Бел хлеб", "Аки лев велика"
 */

/**
 *  Написать функцию, которая выведет в консоль дерево всех файлов и папок с учетом вложенности
 *  
 *  Ограничения: нельзя использовать рекурсию
 */